import React, {Component} from 'react';
import CarouselBox from "../Components/CarouselBox";
import {Card, Container} from "react-bootstrap";

class MainPage extends Component {
    render() {
        return (
            <>
                <CarouselBox />
                <Container>
                    <Card style={{marginTop: '10px'}}>
                        <Card.Body>
                            <Card.Title>Апокалипсис</Card.Title>
                            <Card.Text>
                                Апокалипсис (ударение на вторую «а») это вселенская катастрофа, конец света и полный трындец всему.
                                В дословном переводе с греческого на русский слово апокалипсис означает «откровение».
                                Здесь имеются в виду библейские пророчества, в которых детально описан конец света.
                                В заключительной книге Нового Завета «Откровение Иоанна Богослова», название которой по-гречески звучит
                                как «Апокалипсис Иоаннис», описаны катаклизмы и бедствия, грядущие перед вторым пришествием Христа.
                                В связи с этим слово «апокалипсис» приобрело мрачный оттенок и стало обозначать вселенское бедствие,
                                конец света или просто большую трагедию в жизни человека. «Зомби Апокалипсис» — уничтожение человечества
                                восставшими мертвецами. «Ядерный Апокалипсис» — самоуничтожение человечества вследствие ядерной войны.
                            </Card.Text>
                            <Card.Text>
                                <b>Апокалипсис (греч. apokalypsis - откровение)</b>
                            </Card.Text>
                            <Card.Text>
                                Откровение апостола Иоанна Богослова, одна из книг Нового завета, древнейшее из дошедших до нас христианских
                                литературных произведений. Написан христианином из евреев в середине 68 - начале 69 н. э. (вскоре после смерти
                                римского императора Нерона). По церковной традиции автором А. считается апостол Иоанн Богослов. А. тесно примыкает
                                к ветхозаветным пророческим книгам (частично являясь прямым заимствованием из них), по содержанию резко отличается
                                от других писаний Нового завета. В А. излагаются в форме фантастических видений (выдаваемых автором за «откровение»,
                                полученное им от бога) будущие судьбы мира и человечества: предстоящие якобы борьба между «воинством небесным» и
                                Антихристом, «конец света», «страшный суд», «тысячелетнее царство божье» на Земле. А. отражает недовольство и бунтарские
                                настроения израильского народа, находившегося под гнётом Римского государства и уповавшего на скорую гибель Римской империи.
                                Но в А. впервые выражена идея долготерпения и смирения, в нём содержится призыв к пассивному ожиданию развязки борьбы
                                божественных сил с антихристом в надежде на божественное воздаяние - «тысячелетнее царство божье». Хилиастические настроения
                                (ожидание «тысячелетнего царства»; см. Хилиазм), выраженные в А., получили особое распространение в христианском сектантстве.
                                На протяжении веков А. с его мистическими и устрашающими картинами - одно из идеологических средств воздействия на верующих в
                                руках реакционных сил церкви и сектантов.
                            </Card.Text>
                            <Card.Text>
                                <b>Апокалипсис</b> (или в переводе с греческого — Откровение) святого Иоанна Богослова — это единственная пророческая книга
                                Нового Завета. Она предсказывает о грядущих судьбах человечества, о конце мира и о начале вечной жизни, и поэтому, естественно,
                                помещается в конце Священного Писания.
                            </Card.Text>
                            <Card.Text>
                                <b>Апокалипсис</b> — книга таинственная и трудная для понимания, но вместе с тем именно таинственный характер этой книги и
                                привлекает к себе взоры как верующих христиан, так и просто пытливых мыслителей, старающихся разгадать смысл и значение
                                описанных в ней видений. Об Апокалипсисе существует громадное количество книг, среди которых имеется и немало произведений
                                со всяким вздором, в особенности это относится к современной сектантской литературе.
                            </Card.Text>
                            <Card.Text>
                                Несмотря на трудность понимания этой книги, духовно просвещенные отцы и учители Церкви всегда относились к ней с великим
                                благоговением как к вдохновенной Богом книге. Так, святой Дионисий Александрийский пишет: «Темнота сей книги не препятствует
                                удивляться ей. И если я не все в ней понимаю, то лишь по моей неспособности. Я не могу быть судьей истин, в ней заключающихся,
                                и измерять их скудостью моего ума; руководствуясь более верою, чем разумом, нахожу их только превосходящими мое понимание.» В
                                таком же роде высказывается об Апокалипсисе блаженный Иероним: «В нем столько же тайн, сколько слов. Но что я говорю? Всякая
                                похвала сей книге будет ниже ее достоинства.»
                            </Card.Text>
                            <Card.Text>
                                За богослужением Апокалипсис не читается потому, что в древности чтение Священного Писания за богослужением всегда
                                сопровождалось объяснением его, а Апокалипсис весьма труден для объяснения.
                            </Card.Text>
                            <Card.Text>
                                <b>Откровение Иоанна Богослова</b>
                            </Card.Text>
                            <Card.Text>
                                Автор апокалипсиса называет себя Иоанном (От. 1:1, 4 и 9; 22:8). По общему мнению святых отцов Церкви это был апостол Иоанн,
                                возлюбленный ученик Христов, получивший за высоту своего учения о Боге-Слове отличительное имя «Богослов.» Его авторство
                                подтверждается как данными в самом Апокалипсисе, так и многими другими внутренними и внешними признаками. Вдохновенному перу
                                апостола Иоанна Богослова принадлежит еще Евангелие и три Соборных послания. Автор Апокалипсиса говорит, что он был на острове
                                Патмос «за слово Божие и за свидетельство Иисуса Христа» (От. 1:9). Из церковной истории известно, что из апостолов только
                                святой Иоанн Богослов подвергся заточению на этом острове.
                            </Card.Text>
                            <Card.Text>
                                Доказательством авторства Апокалипсиса ап. Иоанна Богослова служит сходство этой книги с его Евангелием и посланиями не только
                                по духу, но и по слогу, и, особенно, по некоторым характерным выражениям. Так, например, проповедь апостольская называется здесь
                                «свидетельством» (От. 1:2, 9; 20:4; см.: Иоан. 1:7; 3:11; 21:24; 1 Иоан. 5:9-11). Господь Иисус Христос называется «Словом» (От.
                                19:13; см.: Иоан. 1:1, 14 и 1 Иоан. 1:1) и «Агнцем» (От. 5:6 и 17:14; см.: Иоан. 1:36). Пророческие слова Захарии: «и они воззрят
                                на Него, Которого пронзили» (12:10) и в Евангелии, и в Апокалипсисе приводятся одинаково по греческому переводу «Семидесяти
                                толковников» (От. 1:7 и Иоан. 19:37). Некоторые различия между языком Апокалипсиса и другими книгами апостола Иоанна объясняются
                                как разностью содержания, так и обстоятельствами происхождения писаний святого Апостола. Святой Иоанн, иудей по рождению, хотя и
                                владел греческим языком, но, находясь в заточении вдали от живого разговорного греческого языка, естественно наложил на
                                Апокалипсис печать влияния своего родного языка. Для непредубежденного читателя Апокалипсиса очевидно, что на всем содержании его
                                лежит печать великого духа Апостола любви и созерцания.
                            </Card.Text>
                            <Card.Text>
                                Все древние и более поздние святоотеческие свидетельства признают автором Апокалипсиса святого Иоанна Богослова. Его ученик святой
                                Папий Иеропольский называет писателем Апокалипсиса «старца Иоанна,» как называет себя и сам апостол в своих посланиях (2 Иоан. 1:1
                                и 3 Иоан. 1:1). Важно также свидетельство святого Иустина Мученика, жившего в Ефесе еще до своего обращения в христианство, где до
                                него долго жил апостол Иоанн. Многие святые отцы 2-го и 3-го веков приводят места из Апокалипсиса, как из боговдохновенной книги,
                                принадлежащей перу святого Иоанна Богослова. Один из них был святой Ипполит, папа Римский, написавший апологию на Апокалипсис,
                                ученик Иринея Лионского. Климент Александрийский, Тертуллиан и Ориген также признают святого апостола Иоанна автором Апокалипсиса.
                                Равным образом убеждены в этом и более поздние отцы Церкви: преподобный Ефрем Сирин, Епифаний, Василий Великий, Иларий, Афанасий
                                Великий, Григорий Богослов, Дидим, Амвросий Медиоланский, Блаженный Августин и Блаженный Иероним. 33-е правило карфагенского
                                Собора, приписывая Апокалипсис святому Иоанну Богослову, ставит его в ряд других канонических книг Священного Писания. Особенно
                                ценно свидетельство святого Иринея Лионского относительно авторской принадлежности Апокалипсиса святому Иоанну Богослову, так как
                                святой Ириней был учеником святого Поликарпа Смирнского, который в свою очередь был учеником святого Иоанна Богослова, возглавляя
                                под его апостольским руководством Смирнскую церковь.
                            </Card.Text>
                        </Card.Body>
                    </Card>
                </Container>
            </>
        );
    }
}

export default MainPage;